print('Шляпка гриба, … кожиц..й, держится … ножк.. . Снизу шляпка … плёнкой. Когда её уберёшь, откроется … сторона шляпк.. .')
k=input('Введите пропущенное слово:')
b=input('Введите пропущенную букву:')
t=input('Введите пропущенное слово:')
c=input('Введите пропущенную букву:')
l=input('Введите пропущенное слово:')
m=input('Введите пропущенное слово:')
d=input('Введите пропущенную букву:')


a=f'Шляпка гриба, {k} кожиц{b}й, держится {t} ножк{c}. Снизу шляпка {l} плёнкой. Когда её уберёшь, откроется {m} сторона шляпк{d}.'
print(a)
